fio/ceph-file-layout/bs_su128k_o4m/randr_s1m_j1.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
fio-3.18
Starting 1 thread

randr: (groupid=0, jobs=1): err= 0: pid=107762: Fri Feb 21 14:20:50 2020
  read: IOPS=1843, BW=14.4MiB/s (15.1MB/s)(4321MiB/300001msec)
    slat (usec): min=21, max=243, avg=37.88, stdev= 3.70
    clat (usec): min=305, max=6770, avg=503.47, stdev=194.53
     lat (usec): min=337, max=6806, avg=541.48, stdev=194.61
    clat percentiles (usec):
     |  1.00th=[  388],  5.00th=[  416], 10.00th=[  429], 20.00th=[  449],
     | 30.00th=[  461], 40.00th=[  474], 50.00th=[  486], 60.00th=[  498],
     | 70.00th=[  510], 80.00th=[  529], 90.00th=[  562], 95.00th=[  586],
     | 99.00th=[  734], 99.50th=[ 1614], 99.90th=[ 3851], 99.95th=[ 4178],
     | 99.99th=[ 4490]
   bw (  KiB/s): min=13936, max=15568, per=100.00%, avg=14761.64, stdev=295.09, samples=599
   iops        : min= 1742, max= 1946, avg=1845.20, stdev=36.88, samples=599
  lat (usec)   : 500=62.62%, 750=36.45%, 1000=0.28%
  lat (msec)   : 2=0.22%, 4=0.35%, 10=0.08%
  cpu          : usr=0.64%, sys=5.11%, ctx=1105884, majf=0, minf=85
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=553029,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=14.4MiB/s (15.1MB/s), 14.4MiB/s-14.4MiB/s (15.1MB/s-15.1MB/s), io=4321MiB (4530MB), run=300001-300001msec