fio/ceph-file-layout/bs_su128k_o4m/randr_s1m_j2.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 2 threads

randr: (groupid=0, jobs=2): err= 0: pid=107399: Fri Feb 21 14:15:19 2020
  read: IOPS=3251, BW=25.4MiB/s (26.6MB/s)(7621MiB/300017msec)
    slat (usec): min=18, max=260, avg=38.47, stdev= 5.24
    clat (usec): min=250, max=324230, avg=575.23, stdev=2223.19
     lat (usec): min=342, max=324261, avg=613.83, stdev=2223.24
    clat percentiles (usec):
     |  1.00th=[   392],  5.00th=[   420], 10.00th=[   437], 20.00th=[   457],
     | 30.00th=[   469], 40.00th=[   486], 50.00th=[   498], 60.00th=[   510],
     | 70.00th=[   529], 80.00th=[   553], 90.00th=[   586], 95.00th=[   627],
     | 99.00th=[   807], 99.50th=[  2245], 99.90th=[  4490], 99.95th=[ 50594],
     | 99.99th=[113771]
   bw (  KiB/s): min=13920, max=30224, per=100.00%, avg=26037.98, stdev=3605.41, samples=1198
   iops        : min= 1740, max= 3778, avg=3254.75, stdev=450.68, samples=1198
  lat (usec)   : 500=52.27%, 750=46.48%, 1000=0.45%
  lat (msec)   : 2=0.25%, 4=0.36%, 10=0.10%, 20=0.01%, 50=0.03%
  lat (msec)   : 100=0.03%, 250=0.02%, 500=0.01%
  cpu          : usr=0.64%, sys=4.62%, ctx=1944383, majf=0, minf=297
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=975464,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=25.4MiB/s (26.6MB/s), 25.4MiB/s-25.4MiB/s (26.6MB/s-26.6MB/s), io=7621MiB (7991MB), run=300017-300017msec