fio/ceph-file-layout/bs_su128k_o4m/randr_s1m_j8.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 8 threads

randr: (groupid=0, jobs=8): err= 0: pid=106616: Fri Feb 21 14:04:17 2020
  read: IOPS=12.4k, BW=97.2MiB/s (102MB/s)(28.5GiB/300002msec)
    slat (usec): min=19, max=783, avg=49.25, stdev=14.93
    clat (usec): min=2, max=152402, avg=592.11, stdev=793.16
     lat (usec): min=348, max=152430, avg=641.52, stdev=793.28
    clat percentiles (usec):
     |  1.00th=[  408],  5.00th=[  445], 10.00th=[  465], 20.00th=[  494],
     | 30.00th=[  515], 40.00th=[  529], 50.00th=[  553], 60.00th=[  570],
     | 70.00th=[  594], 80.00th=[  627], 90.00th=[  676], 95.00th=[  725],
     | 99.00th=[ 1106], 99.50th=[ 2638], 99.90th=[ 4490], 99.95th=[ 5014],
     | 99.99th=[42730]
   bw (  KiB/s): min=82304, max=107360, per=100.00%, avg=99638.05, stdev=1416.41, samples=4784
   iops        : min=10288, max=13420, avg=12454.75, stdev=177.05, samples=4784
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.01%, 500=23.56%, 750=72.69%, 1000=2.68%
  lat (msec)   : 2=0.38%, 4=0.51%, 10=0.16%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.53%, sys=6.18%, ctx=7049437, majf=0, minf=13677
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3732310,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=97.2MiB/s (102MB/s), 97.2MiB/s-97.2MiB/s (102MB/s-102MB/s), io=28.5GiB (30.6GB), run=300002-300002msec