fio/ceph-file-layout/bs_su128k_o4m/seqw_s2g_j16.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 16 threads

seqw: (groupid=0, jobs=16): err= 0: pid=93325: Fri Feb 21 10:54:28 2020
  write: IOPS=5377, BW=336MiB/s (352MB/s)(98.5GiB/300002msec)
    slat (usec): min=22, max=1462, avg=85.92, stdev=30.73
    clat (usec): min=494, max=607411, avg=2887.24, stdev=10437.47
     lat (usec): min=837, max=607513, avg=2973.36, stdev=10437.07
    clat percentiles (usec):
     |  1.00th=[   988],  5.00th=[  1106], 10.00th=[  1205], 20.00th=[  1336],
     | 30.00th=[  1450], 40.00th=[  1549], 50.00th=[  1647], 60.00th=[  1762],
     | 70.00th=[  1909], 80.00th=[  2278], 90.00th=[  4490], 95.00th=[  5276],
     | 99.00th=[ 16712], 99.50th=[ 55313], 99.90th=[175113], 99.95th=[223347],
     | 99.99th=[316670]
   bw (  KiB/s): min=11520, max=715648, per=100.00%, avg=344531.10, stdev=10292.41, samples=9584
   iops        : min=  180, max=11182, avg=5383.28, stdev=160.82, samples=9584
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=1.27%
  lat (msec)   : 2=72.55%, 4=13.46%, 10=11.49%, 20=0.29%, 50=0.37%
  lat (msec)   : 100=0.30%, 250=0.23%, 500=0.03%, 750=0.01%
  cpu          : usr=0.14%, sys=1.63%, ctx=2897531, majf=0, minf=33667
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1613387,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=336MiB/s (352MB/s), 336MiB/s-336MiB/s (352MB/s-352MB/s), io=98.5GiB (106GB), run=300002-300002msec