fio/ceph-file-layout/bs_su128k_o4m/seqw_s2g_j2.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 2 threads

seqw: (groupid=0, jobs=2): err= 0: pid=94505: Fri Feb 21 11:11:13 2020
  write: IOPS=1185, BW=74.1MiB/s (77.7MB/s)(21.7GiB/300001msec)
    slat (usec): min=22, max=476, avg=45.39, stdev=18.39
    clat (usec): min=558, max=552270, avg=1639.47, stdev=7510.68
     lat (usec): min=829, max=552304, avg=1685.01, stdev=7510.41
    clat percentiles (usec):
     |  1.00th=[   873],  5.00th=[   922], 10.00th=[   955], 20.00th=[  1012],
     | 30.00th=[  1057], 40.00th=[  1106], 50.00th=[  1156], 60.00th=[  1221],
     | 70.00th=[  1287], 80.00th=[  1369], 90.00th=[  1516], 95.00th=[  2114],
     | 99.00th=[  4752], 99.50th=[  5669], 99.90th=[137364], 99.95th=[187696],
     | 99.99th=[270533]
   bw (  KiB/s): min=  640, max=106624, per=100.00%, avg=75991.27, stdev=17450.52, samples=1198
   iops        : min=   10, max= 1666, avg=1187.36, stdev=272.67, samples=1198
  lat (usec)   : 750=0.01%, 1000=18.11%
  lat (msec)   : 2=76.56%, 4=3.64%, 10=1.34%, 20=0.04%, 50=0.07%
  lat (msec)   : 100=0.08%, 250=0.14%, 500=0.01%, 750=0.01%
  cpu          : usr=0.23%, sys=2.22%, ctx=437993, majf=0, minf=1494
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,355796,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=74.1MiB/s (77.7MB/s), 74.1MiB/s-74.1MiB/s (77.7MB/s-77.7MB/s), io=21.7GiB (23.3GB), run=300001-300001msec