fio/ceph-file-layout/bs_su128k_o4m/seqw_s2g_j32.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 32 threads

seqw: (groupid=0, jobs=32): err= 0: pid=92992: Fri Feb 21 10:48:53 2020
  write: IOPS=7420, BW=464MiB/s (486MB/s)(136GiB/300005msec)
    slat (usec): min=23, max=2175, avg=103.61, stdev=37.86
    clat (usec): min=4, max=1089.3k, avg=4206.30, stdev=14947.77
     lat (usec): min=890, max=1089.4k, avg=4310.13, stdev=14947.79
    clat percentiles (usec):
     |  1.00th=[  1090],  5.00th=[  1270], 10.00th=[  1401], 20.00th=[  1598],
     | 30.00th=[  1762], 40.00th=[  1909], 50.00th=[  2114], 60.00th=[  2376],
     | 70.00th=[  2835], 80.00th=[  4359], 90.00th=[  5538], 95.00th=[  6521],
     | 99.00th=[ 47973], 99.50th=[ 95945], 99.90th=[233833], 99.95th=[283116],
     | 99.99th=[400557]
   bw (  KiB/s): min= 8832, max=1094528, per=100.00%, avg=475796.09, stdev=8034.94, samples=19114
   iops        : min=  138, max=17102, avg=7434.28, stdev=125.55, samples=19114
  lat (usec)   : 10=0.01%, 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.22%
  lat (msec)   : 2=44.56%, 4=33.07%, 10=19.68%, 20=0.83%, 50=0.67%
  lat (msec)   : 100=0.49%, 250=0.40%, 500=0.08%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.10%, sys=1.33%, ctx=4345276, majf=0, minf=80536
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2226326,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=464MiB/s (486MB/s), 464MiB/s-464MiB/s (486MB/s-486MB/s), io=136GiB (146GB), run=300005-300005msec